<!-- terraform-plan-comment -->
# Terraform Plan Results

**3 change(s):** 2 to create, 1 to update, 0 to replace, 0 to destroy

**⚠️ Resources will be modified**

## Resources to create:
- `databricks_catalog.segment_storage`
- `databricks_grants.catalog_segment_storage`

## Resources to update:
- `databricks_grants.catalog_main`

<details>
<summary>Show diff</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # databricks_catalog.segment_storage will be created
  + resource "databricks_catalog" "segment_storage" {
      + catalog_type                   = (known after apply)
      + comment                        = "Dedicated catalog for Segment storage destination"
      + created_at                     = (known after apply)
      + created_by                     = (known after apply)
      + enable_predictive_optimization = (known after apply)
      + force_destroy                  = false
      + full_name                      = (known after apply)
      + id                             = (known after apply)
      + isolation_mode                 = "OPEN"
      + metastore_id                   = (known after apply)
      + name                           = "segment_storage"
      + owner                          = (known after apply)
      + properties                     = {
          + "managed_by" = "terraform"
        }
      + securable_type                 = (known after apply)
      + storage_location               = (known after apply)
      + updated_at                     = (known after apply)
      + updated_by                     = (known after apply)

      + effective_predictive_optimization_flag (known after apply)

      + provisioning_info (known after apply)
    }

  # databricks_grants.catalog_main will be updated in-place
  ~ resource "databricks_grants" "catalog_main" {
        id      = "catalog/goodparty_data_catalog"
        # (1 unchanged attribute hidden)

      - grant {
          - principal  = "0d945bd8-d62f-4e9f-80bf-e3c40b2ea1ec" -> null
          - privileges = [
              - "CREATE_SCHEMA",
              - "CREATE_TABLE",
              - "SELECT",
              - "USE_CATALOG",
              - "USE_SCHEMA",
            ] -> null
        }

        # (16 unchanged blocks hidden)
    }

  # databricks_grants.catalog_segment_storage will be created
  + resource "databricks_grants" "catalog_segment_storage" {
      + catalog = "segment_storage"
      + id      = (known after apply)

      + grant {
          + principal  = "0d945bd8-d62f-4e9f-80bf-e3c40b2ea1ec"
          + privileges = [
              + "CREATE_SCHEMA",
              + "CREATE_TABLE",
              + "SELECT",
              + "USE_CATALOG",
              + "USE_SCHEMA",
            ]
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>

---

<details>
<summary>What do these mean?</summary>

- **Create**: New resources will be added
- **Update**: Existing resources will be modified in-place
- **Replace**: Resources will be destroyed and recreated (data loss possible)
- **Destroy**: Resources will be permanently deleted

</details>

---

**To apply these changes:**

1. **Merge** this PR to `main`
2. **Review** the plan in the workflow run triggered by the merge
3. **Deploy** via Actions → Deploy → Run workflow → uncheck "Dry run"

Or via CLI after merge: `gh workflow run deploy.yaml -f dry_run=false`
